<!DOCTYPE html>
<html lang="ja">
  <head>
    <meta charset="UTF-8">
  </head>
  <body>
    <h1>好きなクラスを定義し、オブジェクトを作り、メソッドを使ってみる</h1>

    <!-- クラスを自身で定義してみることは理解の手助けになります。 -->

    <?php
    // 書き始め、クラス名の先頭は大文字にします。


    // 次にオブジェクトに保持させたい変数を書きます。


    // 次にコンストラクタが必要です。
    // コンストラクタはオブジェクトを作った瞬間に、上で書いた変数全てに何かが入る（存在する）ようにしてあげるためのものです。
    // （存在しない変数を使おうとすると使おうとした瞬間にPHPはエラーを吐くので、それを避けるために、オブジェクトを作った瞬間には上で書いた変数全てになにかを入れてあげなければいけないのです。）


    // その後は好きなメソッド（関数）を定義します。


    ?>


  </body>
</html>
